{
  "config": {
    "step": {
      "user": {
        "title": "Connect to Homey",
        "description": "Enter your Homey IP address and API key to connect.\n\n⚠️ **For Real-Time Updates**: To enable Socket.IO instant updates (< 1 second), create a new API key in Homey Settings → API Keys with the **System → View System** (`homey.system.readonly`) permission enabled. Without this, the integration will use polling (5-10 seconds).",
        "data": {
          "host": "Homey IP Address or Hostname",
          "token": "API Key"
        }
      },
      "reauth_confirm": {
        "title": "Reauthenticate Homey",
        "description": "Your Homey API key is no longer valid. Create a new API key in Homey Settings → API Keys with the required permissions and enter it below.",
        "data": {
          "host": "Homey IP Address or Hostname",
          "token": "API Key"
        }
      },
      "device_selection": {
        "title": "Select Devices",
        "description": "Select which devices to import into Home Assistant. All devices are selected by default—deselect any you don't want to import.",
        "data": {}
      },
      "device_management": {
        "title": "Manage Devices",
        "description": "Select which devices to include in Home Assistant. Currently selected devices are pre-checked. You can add or remove devices as needed. Changes will be applied after saving.\n\n💡 Tip: Use your browser's search (Ctrl+F / Cmd+F) to quickly find devices by name, room, or type.",
        "data": {}
      }
    },
    "error": {
      "cannot_connect": "Unable to connect to Homey. Please check:\n- The IP address is correct\n- Homey is powered on and accessible on your network\n- The API key is valid\n- Homey API is enabled",
      "invalid_auth": "Invalid API key. Please check your API key in Homey Settings → API Keys.",
      "cannot_fetch_devices": "Unable to fetch devices from Homey. The connection was successful but device list could not be retrieved. Proceeding with all devices.",
      "unknown": "An unexpected error occurred. Check the logs for details."
    },
    "abort": {
      "already_configured": "This Homey hub is already configured.",
      "reauth_successful": "Reauthentication successful."
    }
  },
  "options": {
    "step": {
      "init": {
        "title": "Homey Options",
        "description": "Choose what you want to update.",
        "menu_options": {
          "settings": "Connection & Polling",
          "device_management": "Manage Devices"
        }
      },
      "settings": {
        "title": "Connection & Polling",
        "description": "Update Homey connection settings and fallback polling. Leave API key blank to keep the current one. Polling is only used when Socket.IO is not working. For Socket.IO real-time updates, create a new API key with **System → View System** (`homey.system.readonly`).\n\nEditable text inputs: When enabled, settable string capabilities without predefined options will appear as editable text fields. This disables the read-only sensors below to avoid duplicates.\n\nRead-only strings (default on): When enabled, string capabilities are shown as read-only sensors (useful for status/notification fields). This is ignored if editable text inputs are enabled.",
        "data": {
          "host": "Homey IP Address or Hostname",
          "token": "API Key (leave blank to keep current)",
          "poll_interval": "Fallback polling interval (seconds)",
          "recovery_cooldown": "Recovery cooldown (seconds, between auto-recovery attempts)",
          "expose_settable_text": "Expose string capabilities as editable text inputs (disables read-only)",
          "expose_readonly_strings": "Expose string capabilities as read-only sensors (default, off when editable is enabled)",
          "use_capability_titles": "Use Homey capability titles for entity names"
        }
      },
      "device_management": {
        "title": "Manage Devices",
        "description": "Select which devices to include in Home Assistant. All devices are selected by default—deselect any you don't want to import.",
        "data": {
          "device_filter": "Devices"
        }
      }
    }
  }
}

